avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
/*
 * STM32N6570 KVS WebRTC port — media_cam.c
 *
 * DCMIPP camera initialisation for the KVS WebRTC media pipeline.
 * Derived from x-cube-n6-ai-h264-usb-uvc/Src/app_cam.c with the
 * AI/NPU (PIPE2) and USB-UVC output paths removed.
 *
 * Copyright (c) 2023 STMicroelectronics.  All rights reserved.
 * SPDX-License-Identifier: LicenseRef-STMicroelectronics
 */

#include <assert.h>
#include "media_cam.h"
#include "media_cam_config.h"   /* sensor / venc dimension macros          */
#include "cmw_camera.h"
#include "../../ai/ai_detection.h"
#include "lcd_preview.h"         /* LTDC layer flip from the frame ISR      */
#include "isp_core.h"            /* ISP_SensorInfoTypeDef                   */
#include "FreeRTOS.h"            /* vPetWatchdog() declared in FreeRTOSConfig.h */
#include "task.h"                /* vTaskDelay for post-start poll loop     */
#include "semphr.h"              /* binary sem for frame-ready signaling    */
#include "stm32n6570_discovery_bus.h"  /* BSP_I2C1_ReadReg16 for sensor probe */

#include "logging_levels.h"
#define LOG_LEVEL   LOG_INFO
#include "logging.h"

/* ── Raw UART debug (bypasses FreeRTOS logging) ────────────────────────── */
/* Bounded spin — see rationale in kvs_webrtc_task.c. */
extern void vPetWatchdog( void );
static inline void raw_putc( char c )
{
    for( uint32_t i = 0; i < 600000UL; i++ )
    {
        if( *(volatile uint32_t *)0x56000C1CUL & ( 1UL << 7 ) )
        {
            *(volatile uint32_t *)0x56000C28UL = ( uint32_t ) c;
            return;
        }
    }
    vPetWatchdog();
}
static void raw_puts( const char *s ) { while( *s ) raw_putc( *s++ ); }
static void raw_hex32( uint32_t v )
{
    static const char hex[] = "0123456789ABCDEF";
    raw_putc( '0' ); raw_putc( 'x' );
    for( int i = 28; i >= 0; i -= 4 )
        raw_putc( hex[ ( v >> i ) & 0xF ] );
}
static void raw_dec( uint32_t v )
{
    char buf[ 11 ];
    int  n = 0;
    if( v == 0 ) { raw_putc( '0' ); return; }
    while( v > 0 ) { buf[ n++ ] = '0' + ( v % 10 ); v /= 10; }
    while( n-- ) raw_putc( buf[ n ] );
}

/* ── Private state ──────────────────────────────────────────────────────── */
static int xSensorWidth;
static int xSensorHeight;
static int xVencWidth;
static int xVencHeight;
static int xSensorMirrorFlip = CMW_MIRRORFLIP_NONE;

/* ── Double-buffer ping-pong state ─────────────────────────────────────── */
/*
 * xFrameReadySem is a binary semaphore "given" from the DCMIPP frame-event
 * ISR (via CMW_CAMERA_PIPE_FrameEventCallback override below) whenever a
 * full frame has just been written.  The media task blocks on it in
 * MediaCam_WaitFrame().
 *
 * xPingPongY[] / xPingPongUV[] record the Y-plane and UV-plane pointers
 * for each of the two DCMIPP ping-pong slots.  ulFrameCount is incremented
 * on each frame-event; since DCMIPP DBM starts by writing slot 0 and
 * alternates thereafter:
 *    ulFrameCount == 1 → slot 0 just completed
 *    ulFrameCount == 2 → slot 1 just completed
 *    ...
 * So the just-completed (Y, UV) pair is at index ((ulFrameCount - 1) & 1).
 */
static SemaphoreHandle_t xFrameReadySem     = NULL;
static uint8_t *         pucPingPongY[ 2 ]  = { NULL, NULL };
static uint8_t *         pucPingPongUV[ 2 ] = { NULL, NULL };
static volatile uint32_t ulFrameEventCount   = 0;

/* ── Internal helpers ───────────────────────────────────────────────────── */

static void prvSetSensorInfo( CMW_Sensor_Name_t eSensor )
{
    switch( eSensor )
    {
        case CMW_VD66GY_Sensor:
            xSensorWidth      = SENSOR_VD66GY_WIDTH;
            xSensorHeight     = SENSOR_VD66GY_HEIGHT;
            xSensorMirrorFlip = SENSOR_VD66GY_FLIP;
            xVencWidth        = VENC_VD66GY_WIDTH;
            xVencHeight       = VENC_VD66GY_HEIGHT;
            break;
        case CMW_IMX335_Sensor:
            xSensorWidth      = SENSOR_IMX335_WIDTH;
            xSensorHeight     = SENSOR_IMX335_HEIGHT;
            xSensorMirrorFlip = SENSOR_IMX335_FLIP;
            xVencWidth        = VENC_IMX335_WIDTH;
            xVencHeight       = VENC_IMX335_HEIGHT;
            break;
        case CMW_VD55G1_Sensor:
            xSensorWidth      = SENSOR_VD55G1_WIDTH;
            xSensorHeight     = SENSOR_VD55G1_HEIGHT;
            xSensorMirrorFlip = SENSOR_VD55G1_FLIP;
            xVencWidth        = VENC_VD55G1_WIDTH;
            xVencHeight       = VENC_VD55G1_HEIGHT;
            break;
        case CMW_VD1943_Sensor:
            xSensorWidth      = SENSOR_VD1943_WIDTH;
            xSensorHeight     = SENSOR_VD1943_HEIGHT;
            xSensorMirrorFlip = SENSOR_VD1943_FLIP;
            xVencWidth        = VENC_VD1943_WIDTH;
            xVencHeight       = VENC_VD1943_HEIGHT;
            break;
        default:
            assert( 0 );
    }
}

static void prvInitCropConfig( CMW_Manual_roi_area_t * pxRoi,
                               int lSensorW,
                               int lSensorH )
{
#define MIN( a, b )  ( ( (a) < (b) ) ? (a) : (b) )
    const float fRatioX = ( float ) lSensorW / xVencWidth;
    const float fRatioY = ( float ) lSensorH / xVencHeight;
    const float fRatio  = MIN( fRatioX, fRatioY );

    assert( fRatio >= 1 );
    assert( fRatio < 64 );

    pxRoi->width    = ( uint32_t ) MIN( xVencWidth  * fRatio, lSensorW );
    pxRoi->height   = ( uint32_t ) MIN( xVencHeight * fRatio, lSensorH );
    pxRoi->offset_x = ( lSensorW - ( int ) pxRoi->width  + 1 ) / 2;
    pxRoi->offset_y = ( lSensorH - ( int ) pxRoi->height + 1 ) / 2;
#undef MIN
}

static void prvDCMIPP_PipeInitEncoder( int lSensorW, int lSensorH )
{
    CMW_DCMIPP_Conf_t xConf;
    uint32_t ulPitch;
    int ret;

    xConf.output_width           = xVencWidth;
    xConf.output_height          = xVencHeight;
    xConf.output_format          = CAPTURE_FORMAT;
    xConf.output_bpp             = CAPTURE_BPP;
    xConf.mode                   = CMW_Aspect_ratio_manual_roi;
    xConf.enable_swap            = 0;
    xConf.enable_gamma_conversion = 0;
    prvInitCropConfig( &xConf.manual_conf, lSensorW, lSensorH );

    ret = CMW_CAMERA_SetPipeConfig( DCMIPP_PIPE1, &xConf, &ulPitch );
    assert( ret == HAL_OK );
    assert( ulPitch == ( uint32_t )( xConf.output_width * xConf.output_bpp ) );

    /* PIPE2 -> NPU model input (no-op unless ENABLE_AI_DETECTION). */
    AiDetection_PipeInit( lSensorW, lSensorH );
}

static void prvDCMIPP_IpPlugInit( DCMIPP_HandleTypeDef * pxHdcmipp )
{
    DCMIPP_IPPlugConfTypeDef xIpPlugConf = { 0 };
    int ret;

    /* DCMIPP IpPlug config — hybrid of reference and PSRAM-friendly backoff.
     *
     * DPREG PARTITION (matches x-cube-n6-ai-h264-usb-uvc reference):
     * Even though only PIPE1/CLIENT5 is actually streaming, CLIENT2 must
     * still be configured so the DPREG (data prefetch register) buffer
     * space is explicitly partitioned.  When CLIENT2 is left at its
     * default/reset range, it overlaps CLIENT5's range and the DCMIPP
     * produces exactly one good frame then stops reloading.  Symptom seen
     * prior: F0=37KB I-frame followed by ~46-byte "skip-all-macroblocks"
     * P-frames, viewer showed "frozen" stripes.
     *
     * We give CLIENT5 the LARGE share of DPREG since it's the only pipe
     * actually running, and CLIENT2 gets a minimal 80-page slice.  This
     * is opposite of the reference (which runs CLIENT2/PIPE2 as the NN
     * pipe at higher data rate than the display pipe).
     *
     * BURST / OUTSTANDING (PSRAM-friendly, NOT matching reference):
     * Reference uses BURST_128 / OUTSTANDING_3 on CLIENT5.  That works in
     * the reference (USB device, no lwIP) but in our port VENC reads +
     * DCMIPP writes + Wi-Fi TX all contend for XSPI1/PSRAM bandwidth.
     * BURST_128 starved Wi-Fi TX pbuf allocation → lwIP pbuf_alloc hung
     * in the RTP packetizer ~14 packets into the first I-frame ("video
     * is black" because viewer never received a complete I-frame).
     * Keeping BURST_64 / OUTSTANDING_2 preserves headroom for the
     * network stack while still allowing enough DCMIPP throughput.       */
    xIpPlugConf.MemoryPageSize = DCMIPP_MEMORY_PAGE_SIZE_256BYTES;

    /* REPARTITION (2026-07-20): with PIPE2 live, the old two-client split
     * was backwards for this workload.  Per RM0486 the IPPLUG clients are
     * Client1=Pipe0, Client2=Pipe1 main plane (our NV12 Y), Client3=Pipe1
     * second plane (our UV), Client5=Pipe2 — so the old config gave the
     * NN pipe (CLIENT5) a 4.5KB FIFO and 15/16 arbitration weight while
     * PIPE1-Y (CLIENT2) had a one-line FIFO at 1/16 weight and PIPE1-UV
     * (CLIENT3) was never configured.  Symptom: the moment PIPE2 started,
     * PIPE1 frames became changing garbage (8-9KB P-frames of noise, Y
     * probe blind to it) and sessions collapsed.  Now every client gets
     * an explicit non-overlapping slice (>=2 lines: Y/UV lines are 640B,
     * PIPE2 RGB888 line is 672B; DPREG unit is 8 bytes, 1024 total) and
     * PIPE1's planes outweigh PIPE2.  BURST_64 kept everywhere — see the
     * PSRAM note above. */

    xIpPlugConf.Client                     = DCMIPP_CLIENT1;   /* Pipe0: unused */
    xIpPlugConf.Traffic                    = DCMIPP_TRAFFIC_BURST_SIZE_64BYTES;
    xIpPlugConf.MaxOutstandingTransactions = DCMIPP_OUTSTANDING_TRANSACTION_NONE;
    xIpPlugConf.DPREGStart                 = 0;
    xIpPlugConf.DPREGEnd                   = 31;
    xIpPlugConf.WLRURatio                  = 0;
    ret = HAL_DCMIPP_SetIPPlugConfig( pxHdcmipp, &xIpPlugConf );
    assert( ret == HAL_OK );

    xIpPlugConf.Client                     = DCMIPP_CLIENT2;   /* Pipe1 Y: 2560B = 4 lines */
    xIpPlugConf.Traffic                    = DCMIPP_TRAFFIC_BURST_SIZE_64BYTES;
    xIpPlugConf.MaxOutstandingTransactions = DCMIPP_OUTSTANDING_TRANSACTION_2;
    xIpPlugConf.DPREGStart                 = 32;
    xIpPlugConf.DPREGEnd                   = 351;
    xIpPlugConf.WLRURatio                  = 15;
    ret = HAL_DCMIPP_SetIPPlugConfig( pxHdcmipp, &xIpPlugConf );
    assert( ret == HAL_OK );

