avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
    xIpPlugConf.Client                     = DCMIPP_CLIENT3;   /* Pipe1 UV: 2048B = 3 lines */
    xIpPlugConf.Traffic                    = DCMIPP_TRAFFIC_BURST_SIZE_64BYTES;
    xIpPlugConf.MaxOutstandingTransactions = DCMIPP_OUTSTANDING_TRANSACTION_2;
    xIpPlugConf.DPREGStart                 = 352;
    xIpPlugConf.DPREGEnd                   = 607;
    xIpPlugConf.WLRURatio                  = 7;
    ret = HAL_DCMIPP_SetIPPlugConfig( pxHdcmipp, &xIpPlugConf );
    assert( ret == HAL_OK );

    xIpPlugConf.Client                     = DCMIPP_CLIENT4;   /* Pipe1 3rd plane: unused */
    xIpPlugConf.Traffic                    = DCMIPP_TRAFFIC_BURST_SIZE_64BYTES;
    xIpPlugConf.MaxOutstandingTransactions = DCMIPP_OUTSTANDING_TRANSACTION_NONE;
    xIpPlugConf.DPREGStart                 = 608;
    xIpPlugConf.DPREGEnd                   = 671;
    xIpPlugConf.WLRURatio                  = 0;
    ret = HAL_DCMIPP_SetIPPlugConfig( pxHdcmipp, &xIpPlugConf );
    assert( ret == HAL_OK );

    xIpPlugConf.Client                     = DCMIPP_CLIENT5;   /* Pipe2 NN: 2816B = 4 lines */
    xIpPlugConf.Traffic                    = DCMIPP_TRAFFIC_BURST_SIZE_64BYTES;
    xIpPlugConf.MaxOutstandingTransactions = DCMIPP_OUTSTANDING_TRANSACTION_NONE;
    xIpPlugConf.DPREGStart                 = 672;
    xIpPlugConf.DPREGEnd                   = 1023;
    xIpPlugConf.WLRURatio                  = 1;
    ret = HAL_DCMIPP_SetIPPlugConfig( pxHdcmipp, &xIpPlugConf );
    assert( ret == HAL_OK );
}

static void prvDCMIPP_ReduceSpurious( DCMIPP_HandleTypeDef * pxHdcmipp )
{
    int ret;

    ret = HAL_DCMIPP_PIPE_EnableLineEvent( pxHdcmipp, DCMIPP_PIPE1, DCMIPP_MULTILINE_128_LINES );
    assert( ret == HAL_OK );
    ret = HAL_DCMIPP_PIPE_DisableLineEvent( pxHdcmipp, DCMIPP_PIPE1 );
    assert( ret == HAL_OK );
}

/* ── Public API ─────────────────────────────────────────────────────────── */

void MediaCam_Init( void )
{
    CMW_Sensor_Name_t eSensor;
    CMW_CameraInit_t  xCamInit;
    int ret;

    /* --- Step 1 : detect sensor via CMW_CAMERA_GetSensorName() ---
     *
     * GetSensorName runs a Probe_Sensor chain with width=0/height=0/fps=30.
     * For IMX335 this still leaves the sensor in a known state (only one
     * resolution mode IMX335_R2592_1944 exists), but fps will be 30 rather
     * than our target CAMERA_FPS.  The subsequent CMW_CAMERA_Init below
     * re-runs Probe_Sensor with the correct fps.  Mirrors the reference
     * flow in x-cube-n6-ai-h264-usb-uvc/Src/app_cam.c:CAM_Init.            */
    vPetWatchdog();
    raw_puts( "[CAM] GSN>\r\n" );
    ret = CMW_CAMERA_GetSensorName( &eSensor );
    raw_puts( "[CAM] GSN<\r\n" );

    /* Check if GetSensorName left interrupts globally disabled */
    {
        uint32_t ulPrimask;
        __asm volatile( "mrs %0, primask" : "=r"( ulPrimask ) );
        raw_puts( "[CAM] PM=" );
        raw_putc( '0' + ( char )( ulPrimask & 0xF ) );
        raw_puts( "\r\n" );
        if( ulPrimask & 1 )
        {
            raw_puts( "[CAM] IRQs OFF! re-enabling\r\n" );
            __asm volatile( "cpsie i" ::: "memory" );
        }
    }

    vPetWatchdog();
    raw_puts( "[CAM] ret=" );
    raw_putc( '0' + ( char )( ret & 0xF ) );
    raw_puts( " sen=" );
    raw_putc( '0' + ( char )( eSensor & 0xF ) );
    raw_puts( "\r\n" );
    if( ret != CMW_ERROR_NONE )
    {
        raw_puts( "[CAM] FAIL\r\n" );
        return;
    }

    raw_puts( "[CAM] S2 setSensorInfo\r\n" );
    vPetWatchdog();
    prvSetSensorInfo( eSensor );

    /* --- Step 2 : full sensor re-init at target resolution / fps ---
     *
     * CMW_CAMERA_Init re-runs Probe_Sensor.  For IMX335, CMW_CAMERA_IMX335_Init
     * memsets camera_bsp and calls CMW_IMX335_Probe + IMX335_Init again with
     * our requested width/height/fps/mirror_flip values.  The driver programs
     * IMX335_R2592_1944 mode at CAMERA_FPS.                                   */
    xCamInit.width       = xSensorWidth;
    xCamInit.height      = xSensorHeight;
    xCamInit.fps         = CAMERA_FPS;
    xCamInit.mirror_flip = xSensorMirrorFlip;

    raw_puts( "[CAM] S3 Init>\r\n" );
    vPetWatchdog();
    ret = CMW_CAMERA_Init( &xCamInit, NULL );
    vPetWatchdog();
    raw_puts( "[CAM] S3 Init<r=" );
    raw_putc( '0' + ( char )( ret & 0xF ) );
    raw_puts( "\r\n" );
    if( ret != CMW_ERROR_NONE )
    {
        raw_puts( "[CAM] S3 FAIL\r\n" );
        return;
    }

    /* Write back the sensor dims that may have been adjusted by the driver */
    xSensorWidth  = xCamInit.width;
    xSensorHeight = xCamInit.height;

    raw_puts( "[CAM] S5 ipplug\r\n" );
    vPetWatchdog();
    prvDCMIPP_IpPlugInit( CMW_CAMERA_GetDCMIPPHandle() );

    raw_puts( "[CAM] S5 pipeEnc\r\n" );
    vPetWatchdog();
    prvDCMIPP_PipeInitEncoder( xSensorWidth, xSensorHeight );

    raw_puts( "[CAM] S5 spurious\r\n" );
    vPetWatchdog();
    prvDCMIPP_ReduceSpurious( CMW_CAMERA_GetDCMIPPHandle() );
    vPetWatchdog();

    raw_puts( "[CAM] S5 IRQ gate open\r\n" );
    {
        extern volatile uint8_t g_dcmipp_irq_ready;
        g_dcmipp_irq_ready = 1;
    }
    HAL_NVIC_EnableIRQ( CSI_IRQn );
    HAL_NVIC_EnableIRQ( DCMIPP_IRQn );

    raw_puts( "[CAM] DONE\r\n" );
}

void MediaCam_Start( uint8_t * pFrameBuffer, uint32_t ulCamMode )
{
    int ret = CMW_CAMERA_Start( DCMIPP_PIPE1, pFrameBuffer, ulCamMode );
    assert( ret == CMW_ERROR_NONE );
}

void MediaCam_StartDouble( uint8_t * pY0, uint8_t * pUV0,
                           uint8_t * pY1, uint8_t * pUV1,
                           uint32_t  ulCamMode )
{
    DCMIPP_HandleTypeDef * pxHdcmipp = CMW_CAMERA_GetDCMIPPHandle();
#if ( CAPTURE_SEMIPLANAR == 1 )
    DCMIPP_SemiPlanarDstAddressTypeDef xAddr0;
    DCMIPP_SemiPlanarDstAddressTypeDef xAddr1;
#endif
    int ret;

    assert( pY0 != NULL && pUV0 != NULL && pY1 != NULL && pUV1 != NULL );

    /* Lazily create the binary semaphore so that FrameEventCallback (which
     * may fire immediately after the first VSYNC) always finds a valid
     * handle.  Start with it empty — first frame must cause a "give".       */
    if( xFrameReadySem == NULL )
    {
        xFrameReadySem = xSemaphoreCreateBinary();
        configASSERT( xFrameReadySem != NULL );
    }

