avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
    pucPingPongY[ 0 ]  = pY0;
    pucPingPongUV[ 0 ] = pUV0;
    pucPingPongY[ 1 ]  = pY1;
    pucPingPongUV[ 1 ] = pUV1;
    ulFrameEventCount  = 0;

#if ( CAPTURE_SEMIPLANAR == 1 )
    /* Configure RGB→YUV color conversion on PIPE1 so the pixel packer can
     * emit YUV420_2 (NV12).  The CMW middleware only wires this up for the
     * YUV422_1 format; for the semi-planar format we must program the
     * matrix ourselves.  Coefficients are BT.601 full-range RGB→YCbCr, the
     * same ones the middleware uses internally for YUV422_1 in
     * cmw_camera.c:2105.                                                    */
    {
        #define N10( v )  ( ( ( v ) ^ 0x7FF ) + 1 )
        DCMIPP_ColorConversionConfTypeDef xYuvConv = {
            .ClampOutputSamples = ENABLE,
            .OutputSamplesType  = 0,
            .RR = 131,      .RG = N10( 110 ), .RB = N10( 21 ), .RA = 128,
            .GR = 77,       .GG = 150,        .GB = 29,        .GA = 0,
            .BR = N10( 44 ), .BG = N10( 87 ), .BB = 131,       .BA = 128,
        };
        #undef N10

        ret = HAL_DCMIPP_PIPE_SetYUVConversionConfig( pxHdcmipp, DCMIPP_PIPE1, &xYuvConv );
        assert( ret == HAL_OK );
        ret = HAL_DCMIPP_PIPE_EnableYUVConversion( pxHdcmipp, DCMIPP_PIPE1 );
        assert( ret == HAL_OK );
    }
#else
    /* YUV422_1 (single-plane) proving path: the CMW middleware already
     * programmed + enabled the RGB→YUV matrix inside CMW_CAMERA_SetPipeConfig
     * (cmw_camera.c YUV422_1 branch), so nothing to do here. */
    ( void ) pxHdcmipp;
#endif

    /* Print HAL state before DBM start so we can see whether the pipe is
     * READY (the HAL precondition) or stuck in BUSY/ERROR.                  */
    {
        DCMIPP_HandleTypeDef * pxH = CMW_CAMERA_GetDCMIPPHandle();
        raw_puts( "[CAM] pre-DBL State=" ); raw_hex32( ( uint32_t ) pxH->State );
        raw_puts( " P1State=" ); raw_hex32( ( uint32_t ) pxH->PipeState[ DCMIPP_PIPE1 ] );
        raw_puts( "\r\n" );
    }

    /* Diagnostic: confirm Camera_Drv.Start(&camera_bsp) will actually be
     * invoked by CMW_CAMERA_DoubleBufferStart.  That middleware function
     * guards the sensor-start call with `if (!is_camera_started)`, so if
     * the flag is already non-zero the IMX335 MODE_STREAMING I2C write
     * (and the ISP_Start call) are both skipped, which would explain why
     * the CSI receiver sees no SOF/EOF packets despite DBL start returning
     * success.                                                              */
    {
        extern int is_camera_started;
        raw_puts( "[CAM] is_cam_started=" );
        raw_dec( ( uint32_t ) is_camera_started );
        raw_puts( "\r\n" );
    }

#if ( CAPTURE_SEMIPLANAR == 1 )
    /* Assemble the semi-planar DBM address pairs.  DCMIPP checks 16-byte
     * alignment of both Y and UV addresses in the HAL start routine.        */
    xAddr0.YAddress  = ( uint32_t ) pY0;
    xAddr0.UVAddress = ( uint32_t ) pUV0;
    xAddr1.YAddress  = ( uint32_t ) pY1;
    xAddr1.UVAddress = ( uint32_t ) pUV1;

    /* Bypass CMW_CAMERA_DoubleBufferStart — that middleware helper only
     * plumbs the single-plane DBM API (HAL_DCMIPP_CSI_PIPE_DoubleBufferStart)
     * and doesn't know about the UV plane destination registers.  Call the
     * semi-planar HAL directly; then trigger Camera_Drv.Start() by borrowing
     * the "is_camera_started" guard the middleware uses for CMW_CAMERA_Start /
     * CMW_CAMERA_DoubleBufferStart.                                          */
    raw_puts( "[CAM] DBL SP start>\r\n" );
    ret = HAL_DCMIPP_CSI_PIPE_SemiPlanarDoubleBufferStart(
              pxHdcmipp, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0,
              &xAddr0, &xAddr1, ulCamMode );
    raw_puts( "[CAM] DBL SP start<r=" ); raw_dec( ( uint32_t ) ret ); raw_puts( "\r\n" );
    assert( ret == HAL_OK );
#else
    /* EXACT-DONOR PROVING PATH 2026-07-23: single-plane already proven NOT
     * to feed PIPE2 (still 0xFF).  Last topology delta vs the working donor
     * is DBM: donor PIPE1 is SINGLE-BUFFER (HAL_DCMIPP_CSI_PIPE_Start, no
     * DBM bit); ours used DoubleBufferStart.  Replicate the donor exactly —
     * single-buffer, single-plane — to close the PIPE1-topology hypothesis.
     * Only pY0 is written (no ping-pong flip), so the stream tears/garbles;
     * irrelevant, the verdict is the [AI] in-stats line.                    */
    ( void ) pUV0;
    ( void ) pUV1;
    ( void ) pY1;
    raw_puts( "[CAM] SB 1P start>\r\n" );
    ret = HAL_DCMIPP_CSI_PIPE_Start(
              pxHdcmipp, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0,
              ( uint32_t ) pY0, ulCamMode );
    raw_puts( "[CAM] SB 1P start<r=" ); raw_dec( ( uint32_t ) ret ); raw_puts( "\r\n" );
    assert( ret == HAL_OK );
#endif

    /* The semi-planar HAL start enables the DCMIPP capture but does NOT
     * start the sensor.  CMW_CAMERA_DoubleBufferStart normally calls
     * Camera_Drv.Start(&camera_bsp) for that, but Camera_Drv and camera_bsp
     * are static to cmw_camera.c so we can't call them directly.
     *
     * Previously this block poked the IMX335 MODE_SELECT register directly
     * via BSP I2C — that kicked the sensor into streaming, but it skipped
     * ISP_Init() which runs inside CMW_IMX335_Start before the I2C write.
     * Without ISP_Init, the ISP handle stored in CMW_IMX335_t stays zeroed,
     * and the first call to MediaCam_IspUpdate -> ISP_BackgroundProcess
     * dereferences it and takes a NULL-pointer bus fault
     * (CFSR=0x00008200, BFAR=0x00000000, in ISP_Algo_Process).
     *
     * Use the new CMW_CAMERA_StartSensorOnly helper which runs the full
     * ISP_Init + ISP_Start + IMX335_Start (=MODE_STREAMING I2C write)
     * sequence via the existing sensor driver — this leaves hIsp valid
     * so the background ISP algorithm loop can run.                         */
    {
        int32_t lS = CMW_CAMERA_StartSensorOnly();
        raw_puts( "[CAM] sensor start r=" ); raw_dec( ( uint32_t ) lS );
        raw_puts( "\r\n" );
        assert( lS == 0 );
    }

