avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
    /* And after — should still be 1 (Camera_Drv.Start either ran just now
     * or had already run previously).                                       */
    {
        extern int is_camera_started;
        raw_puts( "[CAM] post is_cam_started=" );
        raw_dec( ( uint32_t ) is_camera_started );
        raw_puts( "\r\n" );
    }

    /* Direct I2C probe of the IMX335 sensor to verify:
     *   (a) sensor is still alive on the I2C bus (read chip ID)
     *   (b) MODE_SELECT register is 0x00 = STREAMING (set by IMX335_Start)
     *
     * If ID read fails, the sensor is dead/unresponsive.
     * If MODE_SELECT reads 0x01 = STANDBY, the I2C write to start streaming
     * that CMW_CAMERA_DoubleBufferStart performed did not actually land —
     * somehow the sensor is still in standby even though we thought we'd
     * started it.  This is the key discriminator for why CSI_SR0 shows no
     * SOF/EOF activity.                                                    */
    {
        uint8_t  ucId = 0xFF;
        uint8_t  ucMode = 0xFF;
        int32_t  lR1, lR2;

        /* 0x34 = 8-bit I2C address form for the IMX335, matches
         * CAMERA_IMX335_ADDRESS in cmw_io.h                                 */
        lR1 = BSP_I2C1_ReadReg16( 0x34, 0x3912 /* IMX335_REG_ID */,      &ucId,   1 );
        lR2 = BSP_I2C1_ReadReg16( 0x34, 0x3000 /* IMX335_REG_MODE_SEL */, &ucMode, 1 );

        raw_puts( "[CAM] sensor I2C: ID_r=" ); raw_dec( ( uint32_t )( lR1 & 0xFF ) );
        raw_puts( " ID="  ); raw_hex32( ucId );
        raw_puts( " MODE_r=" ); raw_dec( ( uint32_t )( lR2 & 0xFF ) );
        raw_puts( " MODE=" ); raw_hex32( ucMode );
        raw_puts( "\r\n" );
    }

    /* CRITICAL: clear the sticky CSI flag registers BEFORE dumping so that
     * the subsequent WaitFrame timeout dumps show only NEW events that
     * accumulated during the wait, not the leftover ULPN transition events
     * that were latched way back during PHY init.
     *
     * Previous run observed SR1=0x64000000 (ULPNDL1F|ULPNACTF|ULPNCLF) and
     * the values never changed across multiple 2-second timeout dumps —
     * that could mean either (a) the lanes are completely dead and the
     * bits are stuck at their post-init latched values, or (b) there IS
     * activity but we can't see it because the flags are already set.
     * Clearing forces interpretation (a) vs (b) to be distinguishable:
     *   - If SR1 stays 0 across timeouts → lanes are DEAD (no D-PHY signal)
     *   - If SR1 accumulates new STOP/ACT/ULPN → sensor IS driving lanes
     *     but something else (e.g. DTID mismatch) blocks the VC0 capture. */
    CSI->FCR0 = 0xFFFFFFFFUL;
    CSI->FCR1 = 0xFFFFFFFFUL;

    /* Dump DCMIPP + CSI state immediately after start.  Any difference in
     * subsequent WaitFrame dumps indicates a runtime event.
     *
     * CSI PHY register sanity targets for IMX335 @ 1600 Mbps/lane, 2 lanes:
     *   PFCR   = 0x00010D28  (CCFR=0x28, HSFR=0x0D, DLD=1)
     *   LMCFGR = 0x00210200  (LANENB=2@b8, DL0MAP=1@b16, DL1MAP=2@b20)
     *   PRCR   = 0x00000002  (PEN=1 → PHY out of reset)
     *   PMCR   = 0x00000000  (no force modes)
     *   PCR    = 0x0000000F  (DL0EN|DL1EN|CLEN|PWRDOWN, all enabled)
     *   PTSR   = PHY test status — bit layout TRM, non-zero means lock/OK
     * If any of these read back different, HAL_DCMIPP_CSI_SetConfig never
     * landed the value (or something clobbered it in the idle window).    */
    {
        DCMIPP_TypeDef * pxDc = CMW_CAMERA_GetDCMIPPHandle()->Instance;
        raw_puts( "[CAM] post-DBL CMSR2=" ); raw_hex32( pxDc->CMSR2 );
        raw_puts( " CMIER=" ); raw_hex32( pxDc->CMIER );
        raw_puts( "\r\n  P1FSCR=" ); raw_hex32( pxDc->P1FSCR );
        raw_puts( " P1FCTCR=" ); raw_hex32( pxDc->P1FCTCR );
        raw_puts( "\r\n  P1PPCR=" ); raw_hex32( pxDc->P1PPCR );
        raw_puts( " CMCR=" ); raw_hex32( pxDc->CMCR );
        raw_puts( "\r\n  CSI_CR=" ); raw_hex32( CSI->CR );
        raw_puts( " CSI_PCR=" ); raw_hex32( CSI->PCR );
        raw_puts( "\r\n  CSI_SR0=" ); raw_hex32( CSI->SR0 );
        raw_puts( " CSI_SR1=" ); raw_hex32( CSI->SR1 );
        raw_puts( "\r\n  CSI_ERR1=" ); raw_hex32( CSI->ERR1 );
        raw_puts( " ERR2=" ); raw_hex32( CSI->ERR2 );
        raw_puts( "\r\n  CSI_VC0CFGR1=" ); raw_hex32( CSI->VC0CFGR1 );
        raw_puts( " VC0CFGR2=" ); raw_hex32( CSI->VC0CFGR2 );
        raw_puts( "\r\n  CSI_PRCR=" ); raw_hex32( CSI->PRCR );
        raw_puts( " LMCFGR=" ); raw_hex32( CSI->LMCFGR );
        raw_puts( "\r\n  CSI_PFCR=" ); raw_hex32( CSI->PFCR );
        raw_puts( " PMCR=" ); raw_hex32( CSI->PMCR );
        raw_puts( "\r\n  CSI_PTSR=" ); raw_hex32( CSI->PTSR );
        raw_puts( "\r\n" );
    }

    /* ── FCR1 write-clear verification ───────────────────────────────────────
     *
     * Read SR1, write 0xFFFFFFFF to FCR1, read SR1 again.  If FCR1 is a
     * functional w1c register for SR1's latched bits, `after` should be 0
     * (or at least differ from `before`).  If `after == before`, SR1 bits
     * are either live state (not clearable via FCR1) or FCR1 targets a
     * different set of flags (e.g. interrupt/DMA control, not status).
     * This directly resolves the previous ambiguity where SR1=0x64000000
     * appeared identical in post-DBL and timeout dumps despite FCR clears. */
    {
        uint32_t ulBefore;
        uint32_t ulAfter;

        ulBefore = CSI->SR1;
        CSI->FCR1 = 0xFFFFFFFFUL;
        __DSB();
        ulAfter  = CSI->SR1;

        raw_puts( "  FCR1 clr test SR1 before=" ); raw_hex32( ulBefore );
        raw_puts( " after=" ); raw_hex32( ulAfter ); raw_puts( "\r\n" );
    }

    /* ── Extended CSI activity poll ──────────────────────────────────────────
     *
     * Watch SR0/SR1 for 3 seconds after DBL start, dumping every change.
     * Normal behavior when a sensor is streaming at 15 fps is a 66 ms
     * cadence of state transitions as each frame burst starts/ends on the
     * data lanes (SR0 SOF0F/EOF0F pulses, SR1 STOP/ACT bit wiggles).
     *
     * If we see NOTHING over 3 seconds, the IMX335 MIPI TX is not driving
     * the lanes at all — despite the sensor reporting MODE_SELECT=0x00.
     * If we see activity but no frame event, the issue is downstream of
     * the CSI PHY (DCMIPP pipe config, DBM address latch, etc.).
     * Polls every 10 ms via vTaskDelay so FreeRTOS timers / TCP keepalive
     * still run; pets the watchdog each iteration.                         */
    {
        uint32_t ulSr0Prev;
        uint32_t ulSr1Prev;
        int      iIter;

        ulSr0Prev = CSI->SR0;
        ulSr1Prev = CSI->SR1;
        raw_puts( "  poll t0 SR0=" ); raw_hex32( ulSr0Prev );
        raw_puts( " SR1=" ); raw_hex32( ulSr1Prev ); raw_puts( "\r\n" );

