avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
        for( iIter = 0; iIter < 300; iIter++ )
        {
            uint32_t ulSr0Cur;
            uint32_t ulSr1Cur;

            vTaskDelay( pdMS_TO_TICKS( 10 ) );
            vPetWatchdog();

            ulSr0Cur = CSI->SR0;
            ulSr1Cur = CSI->SR1;

            if( ( ulSr0Cur != ulSr0Prev ) || ( ulSr1Cur != ulSr1Prev ) )
            {
                raw_puts( "  chg t=" ); raw_dec( ( uint32_t ) iIter );
                raw_puts( "0ms SR0=" ); raw_hex32( ulSr0Cur );
                raw_puts( " SR1=" ); raw_hex32( ulSr1Cur );
                raw_puts( "\r\n" );
                ulSr0Prev = ulSr0Cur;
                ulSr1Prev = ulSr1Cur;
            }

            if( ulFrameEventCount > 0U )
            {
                raw_puts( "  FRAME at t=" ); raw_dec( ( uint32_t ) iIter );
                raw_puts( "0ms\r\n" );
                break;
            }
        }

        raw_puts( "  poll end iter=" ); raw_dec( ( uint32_t ) iIter );
        raw_puts( " SR0=" ); raw_hex32( CSI->SR0 );
        raw_puts( " SR1=" ); raw_hex32( CSI->SR1 );
        raw_puts( " fec=" ); raw_dec( ulFrameEventCount );
        raw_puts( "\r\n" );
    }
}

void MediaCam_Stop( void )
{
    DCMIPP_HandleTypeDef * pxH = CMW_CAMERA_GetDCMIPPHandle();
    HAL_StatusTypeDef      rc;

    /* Stop the NPU input pipe first (no-op unless ENABLE_AI_DETECTION). */
    AiDetection_PipeStop();

    raw_puts( "[CAM] Stop>\r\n" );

    /* If the pipe is in ERROR state (e.g. from an OVR that permanently
     * wedged it), force it to BUSY so HAL_DCMIPP_CSI_PIPE_Stop can
     * process it — that function rejects RESET but accepts everything
     * else and transitions to READY.                                       */
    if( pxH->PipeState[ DCMIPP_PIPE1 ] == HAL_DCMIPP_PIPE_STATE_ERROR )
    {
        pxH->PipeState[ DCMIPP_PIPE1 ] = HAL_DCMIPP_PIPE_STATE_BUSY;
    }

    /* Stop the DCMIPP pipe 1 capture + CSI virtual-channel 0.
     * This clears CPTREQ, waits for P1CPTACT to deassert (~1s timeout),
     * disables DBM + pipe + pipe interrupts, stops the CSI VC, and
     * transitions PipeState to READY.                                      */
    rc = HAL_DCMIPP_CSI_PIPE_Stop( pxH, DCMIPP_PIPE1,
                                   DCMIPP_VIRTUAL_CHANNEL0 );
    raw_puts( "[CAM] pipe stop r=" ); raw_dec( ( uint32_t ) rc );
    raw_puts( "\r\n" );

    if( rc != HAL_OK )
    {
        /* Graceful stop failed (hardware wedged).  Force PipeState to
         * READY so the next SemiPlanarDoubleBufferStart doesn't reject
         * on state check.  The hardware may need a full DCMIPP reset in
         * this path — for now, force-clearing state is the best effort.    */
        raw_puts( "[CAM] WARN force PipeState→READY\r\n" );
        pxH->PipeState[ DCMIPP_PIPE1 ] = HAL_DCMIPP_PIPE_STATE_READY;
    }

    /* Put the IMX335 sensor into standby (MODE_SELECT = 0x01) so the
     * MIPI TX lanes go idle.  On restart, CMW_CAMERA_StartSensorOnly()
     * will re-run ISP_Init + ISP_Start + IMX335_Start (MODE_STREAMING).    */
    {
        uint8_t ucStandby = 0x01;
        BSP_I2C1_WriteReg16( 0x34, 0x3000 /* IMX335_REG_MODE_SEL */,
                             &ucStandby, 1 );
        raw_puts( "[CAM] sensor→standby\r\n" );
    }

    /* Decrement is_camera_started so the next StartSensorOnly() call
     * re-runs the full ISP_Init + sensor-start sequence.                   */
    {
        extern int is_camera_started;
        if( is_camera_started > 0 )
        {
            is_camera_started--;
        }
        raw_puts( "[CAM] is_cam_started=" );
        raw_dec( ( uint32_t ) is_camera_started );
        raw_puts( "\r\n" );
    }

    /* Reset frame-event state for the next session */
    ulFrameEventCount = 0;

    raw_puts( "[CAM] Stop<\r\n" );
}

MediaCamFrame_t MediaCam_WaitFrame( void )
{
    extern volatile uint32_t g_dcmipp_irq_count;
    MediaCamFrame_t xRes;
    uint32_t ulCount;
    uint32_t ulIdx;

    assert( xFrameReadySem != NULL );

    /* Wait with a 2s timeout so we can dump diagnostics if the DCMIPP
     * frame-event ISR isn't firing.  On timeout, print DCMIPP register
     * state (CMSR2/CMIER/P1FCTCR/P1PPCR/P1PPM0AR1/P1PPM0AR2) and retry.    */
    while( 1 )
    {
        if( xSemaphoreTake( xFrameReadySem, pdMS_TO_TICKS( 2000U ) ) == pdTRUE )
        {
            break;
        }

        /* TIMEOUT — dump diagnostics and keep waiting */
        {
            DCMIPP_TypeDef * pxDcmipp = CMW_CAMERA_GetDCMIPPHandle()->Instance;
            raw_puts( "[CAM] TIMEOUT irq_cnt=" );
            raw_dec( g_dcmipp_irq_count );
            raw_puts( " fec=" );
            raw_dec( ulFrameEventCount );
            raw_puts( "\r\n" );
            raw_puts( "  CMSR2="     ); raw_hex32( pxDcmipp->CMSR2    );
            raw_puts( " CMIER="      ); raw_hex32( pxDcmipp->CMIER    );
            raw_puts( "\r\n  P1FCTCR=" ); raw_hex32( pxDcmipp->P1FCTCR );
            raw_puts( " P1FSCR="     ); raw_hex32( pxDcmipp->P1FSCR   );
            raw_puts( "\r\n  P1PPCR=" ); raw_hex32( pxDcmipp->P1PPCR  );
            raw_puts( " AR1="        ); raw_hex32( pxDcmipp->P1PPM0AR1 );
            raw_puts( " AR2="        ); raw_hex32( pxDcmipp->P1PPM0AR2 );
            raw_puts( "\r\n  CMCR="  ); raw_hex32( pxDcmipp->CMCR     );
            raw_puts( " CMSR1="      ); raw_hex32( pxDcmipp->CMSR1    );
            raw_puts( "\r\n" );
            /* Also probe the NVIC to confirm DCMIPP_IRQn is enabled */
            {
                uint32_t ulIser = NVIC->ISER[ ( uint32_t )( DCMIPP_IRQn ) >> 5U ];
                uint32_t ulPend = NVIC->ISPR[ ( uint32_t )( DCMIPP_IRQn ) >> 5U ];
                raw_puts( "  NVIC_ISER=" ); raw_hex32( ulIser );
                raw_puts( " NVIC_ISPR="  ); raw_hex32( ulPend );
                raw_puts( "\r\n" );
            }
            /* Dump CSI receiver status — tells us whether the sensor is
             * actually streaming or whether the CSI PHY is silent.          */
            {
                raw_puts( "  CSI_CR="    ); raw_hex32( CSI->CR    );
                raw_puts( " PCR="       ); raw_hex32( CSI->PCR   );
                raw_puts( "\r\n  CSI_SR0=" ); raw_hex32( CSI->SR0   );
                raw_puts( " SR1="       ); raw_hex32( CSI->SR1   );
                raw_puts( "\r\n  CSI_ERR1=" ); raw_hex32( CSI->ERR1 );
                raw_puts( " ERR2="      ); raw_hex32( CSI->ERR2  );
                raw_puts( "\r\n  CSI_PRCR=" ); raw_hex32( CSI->PRCR );
                raw_puts( " LMCFGR="    ); raw_hex32( CSI->LMCFGR );
                raw_puts( "\r\n  CSI_PFCR=" ); raw_hex32( CSI->PFCR );
                raw_puts( " PMCR="      ); raw_hex32( CSI->PMCR );
                raw_puts( "\r\n  CSI_PTSR=" ); raw_hex32( CSI->PTSR );
                raw_puts( "\r\n" );
            }
            /* And the HAL DCMIPP driver's internal state machine */
            {
                DCMIPP_HandleTypeDef * pxH = CMW_CAMERA_GetDCMIPPHandle();
                raw_puts( "  HAL_State=" ); raw_hex32( ( uint32_t ) pxH->State );
                raw_puts( " P1State=" ); raw_hex32( ( uint32_t ) pxH->PipeState[ DCMIPP_PIPE1 ] );
                raw_puts( "\r\n" );
            }
        }
    }

    /* Snapshot ulFrameEventCount with interrupts masked so the ISR can't
     * increment it mid-read.  (It's a 32-bit volatile on an M55 so the
     * read is atomic anyway, but we want a coherent value for the index.)  */
    ulCount = ulFrameEventCount;

