avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/media_cam.c
    /* ulCount=1 → slot 0 just done; ulCount=2 → slot 1 just done; etc.      */
    ulIdx   = ( ulCount - 1U ) & 1U;
    xRes.pY  = pucPingPongY[ ulIdx ];
    xRes.pUV = pucPingPongUV[ ulIdx ];
    return xRes;
}

void MediaCam_IspUpdate( void )
{
    int ret = CMW_CAMERA_Run();
    assert( ret == CMW_ERROR_NONE );
}

int MediaCam_GetWidth( void )
{
    assert( xVencWidth );
    return xVencWidth;
}

int MediaCam_GetHeight( void )
{
    assert( xVencHeight );
    return xVencHeight;
}

/* DCMIPP pipe error recovery.
 *
 * Called from the DCMIPP_IRQn ISR after the HAL OVR handler (see
 * stm32n6xx_hal_dcmipp.c:2307).  By the time we run, the HAL has already:
 *   - Disabled the PIPE1 OVR interrupt (__HAL_DCMIPP_DISABLE_IT)
 *   - Cleared the OVR flag in CMFCR
 *   - Set hdcmipp->ErrorCode |= HAL_DCMIPP_ERROR_PIPE1_OVR
 *   - Set hdcmipp->PipeState[1] = HAL_DCMIPP_PIPE_STATE_ERROR
 *
 * Crucially the pipe HARDWARE keeps running and FRAME interrupts keep
 * firing — only the OVR IT is masked.  The HAL's PipeState going to
 * ERROR would cause subsequent HAL_DCMIPP_* guarded calls to bail with
 * HAL_ERROR, so we reset it back to BUSY.
 *
 * IMPORTANT: We deliberately do NOT re-enable the OVR interrupt.  An
 * earlier version of this callback did, and under heavy PSRAM/AXI
 * contention the OVR flag re-asserted immediately every time, producing
 * a storm of ~100-200 ISR re-entries per frame period.  Each re-entry
 * printed a char over 115200 baud (~87us busy-wait in ISR context), so
 * a 200-char storm pinned the CPU in IRQ for ~17ms every 100ms frame
 * period.  The storm ultimately wedged the media pipeline on downstream
 * h264 send paths.
 *
 * Leaving the OVR IT disabled is safe: frame events continue, no frames
 * are lost beyond those already overrun (hardware issue, not
 * observability), and we simply lose the ability to detect subsequent
 * overruns — which we don't need for recovery.  The media task's 30-
 * frame heartbeat now reports the OVR counter so we still have
 * visibility without ISR-context UART traffic.                         */
#ifndef HAL_DCMIPP_ERROR_PIPE1_OVR
#define HAL_DCMIPP_ERROR_PIPE1_OVR  (0x00000040U)
#endif

volatile uint32_t g_dcmipp_ovr_count = 0;

void CMW_CAMERA_PIPE_ErrorCallback( uint32_t ulPipe )
{
    DCMIPP_HandleTypeDef * pxH;

    pxH = CMW_CAMERA_GetDCMIPPHandle();
    if( pxH == NULL )
    {
        return;
    }

    if( ulPipe == DCMIPP_PIPE1 )
    {
        /* Bump the counter (read by the media task for periodic reporting) */
        g_dcmipp_ovr_count++;

        /* Clear the HAL ErrorCode OVR bit so subsequent HAL calls don't
         * see a stale error.                                            */
        pxH->ErrorCode &= ~HAL_DCMIPP_ERROR_PIPE1_OVR;

        /* Return pipe state from ERROR back to BUSY — capture is still
         * running in the hardware; PipeState should reflect that.       */
        if( pxH->PipeState[ DCMIPP_PIPE1 ] == HAL_DCMIPP_PIPE_STATE_ERROR )
        {
            pxH->PipeState[ DCMIPP_PIPE1 ] = HAL_DCMIPP_PIPE_STATE_BUSY;
        }

        /* Do NOT touch CMFCR (HAL already cleared the flag).
         * Do NOT re-enable CMIER.P1OVRIE — see comment above.          */
    }
    else
    {
        /* PIPE2 path unused in this project.  Increment counter but don't
         * call logging from ISR.                                        */
        g_dcmipp_ovr_count++;
    }
}

/* ── MX_DCMIPP_ClockConfig — strong override ────────────────────────────────
 *
 * The Camera Middleware defines this as a weak no-op (cmw_camera.c:524) and
 * calls it from CMW_CAMERA_Init.  The application MUST override it to
 * configure the DCMIPP + CSI kernel clocks, otherwise the CSI D-PHY has no
 * "cfg_clk" reference and cannot run its escape-mode state machine:
 *   - SR1 lane flags freeze at their post-reset values (observed: 0x64000000
 *     with DL0 "in ULPS" forever)
 *   - No STOP/ACT transitions are ever detected on the data lanes
 *   - No SOF/EOF events arrive → no frame-event callback → media task hangs
 *
 * Clock budget on this project (set up by FSBL/Core/Src/main.c):
 *   HSI  = 64 MHz
 *   PLL1 = HSI * 25 / 1 / 1 / 1 = 1600 MHz (ON)
 *   PLL2 = OFF
 *   PLL3 = OFF
 *   PLL4 = HSI * 25 / 1 / 1 / 1 = 1600 MHz (ON)
 *
 * Target frequencies (matching the x-cube-n6-ai-h264-usb-uvc reference):
 *   IC17 → DCMIPP kernel = 320 MHz  (reference uses PLL2/3 ≈ 333 MHz;
 *                                     closest we can reach is PLL1/5 = 320)
 *   IC18 → CSI D-PHY cfg = 20 MHz   (reference uses PLL1/40 where PLL1=800
 *                                     MHz; our PLL1 is 1600 MHz so PLL1/80
 *                                     lands on the same 20 MHz target that
 *                                     the hardcoded CCFR=0x28 in
 *                                     HAL_DCMIPP_CSI_SetConfig assumes)      */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig( DCMIPP_HandleTypeDef * pxHdcmipp )
{
    RCC_PeriphCLKInitTypeDef xPeriphClk = { 0 };
    HAL_StatusTypeDef         xRet;

    ( void ) pxHdcmipp;

    /* CSI cfg-clock (IC18) = PLL1 / 80 = 20 MHz */
    xPeriphClk.PeriphClockSelection               = RCC_PERIPHCLK_CSI;
    xPeriphClk.ICSelection[ RCC_IC18 ].ClockSelection = RCC_ICCLKSOURCE_PLL1;
    xPeriphClk.ICSelection[ RCC_IC18 ].ClockDivider   = 80;
    xRet = HAL_RCCEx_PeriphCLKConfig( &xPeriphClk );
    if( xRet != HAL_OK )
    {
        return xRet;
    }

    /* DCMIPP kernel clock (IC17) = PLL1 / 5 = 320 MHz */
    xPeriphClk.PeriphClockSelection                 = RCC_PERIPHCLK_DCMIPP;
    xPeriphClk.DcmippClockSelection                 = RCC_DCMIPPCLKSOURCE_IC17;
    xPeriphClk.ICSelection[ RCC_IC17 ].ClockSelection = RCC_ICCLKSOURCE_PLL1;
    xPeriphClk.ICSelection[ RCC_IC17 ].ClockDivider   = 5;
    xRet = HAL_RCCEx_PeriphCLKConfig( &xPeriphClk );
    if( xRet != HAL_OK )
    {
        return xRet;
    }

    raw_puts( "[CAM] IC17=PLL1/5(320M) IC18=PLL1/80(20M)\r\n" );
    return HAL_OK;
}

/* Weak-override of CMW middleware's frame-event dispatch.  Fires from the
 * DCMIPP_IRQn ISR at the end of every captured frame.  In double-buffer
 * mode we use it to wake MediaCam_WaitFrame().
 *
 * IMPORTANT: Do NOT emit UART characters from this ISR.  Per-frame raw_putc
 * here spun the CPU waiting for TXE on the 115200-baud UART (~87us per
 * char) inside an interrupt handler, back-pressuring higher-priority IRQs
 * and worsening AXI contention that likely precipitated DCMIPP OVR events. */
int CMW_CAMERA_PIPE_FrameEventCallback( uint32_t ulPipe )
{
    if( ulPipe == DCMIPP_PIPE2 )
    {
        /* NPU model-input pipe (no-op unless ENABLE_AI_DETECTION). */
        AiDetection_FrameDoneISR();
    }

    if( ( ulPipe == DCMIPP_PIPE1 ) && ( xFrameReadySem != NULL ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        uint32_t   ulDoneIdx;

        ulFrameEventCount++;

        /* LCD preview: point LTDC Layer 1 at the just-completed ping-pong
         * slot (same index math as MediaCam_WaitFrame).  Register writes
         * only; latches at the panel's next vertical blanking.            */
        ulDoneIdx = ( ulFrameEventCount - 1U ) & 1U;
        LcdPreview_ShowFrameISR( pucPingPongY[ ulDoneIdx ],
                                 pucPingPongUV[ ulDoneIdx ] );

        /* Giving a binary sem that is already "available" is a no-op and
         * does not stack — if the media task is slow and we miss events,
         * the task will still wake and use the most recent completed index
         * from ulFrameEventCount.                                           */
        ( void ) xSemaphoreGiveFromISR( xFrameReadySem, &xHigherPriorityTaskWoken );
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
    return 0;
}
